#### SpecTypeId.Reference Members

---

|  |
| --- |
| SpecTypeId Reference Class   Properties   See Also |

This class contains constants identifying specs.

The  SpecTypeId Reference  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | FillPattern | Fill Pattern, in discipline Common. |
| Public property Static member | Image | Image, in discipline Common. |
| Public property Static member | LoadClassification | Load Classification, in discipline Electrical. |
| Public property Static member | Material | Material, in discipline Common. |

# See Also

SpecTypeId Reference Class

Autodesk.Revit.DB Namespace